"use strict"
/*Необхідно написати програму яка буде виводити інформацію за умовами при яких число виводитиметься з правильним словом: "рік", "роки" або "років". Тобто. "29 років" чи "4 роки".

Умови виконання ДЗ

Рік отримувати через prompt()
Зробити перевірку що користувачь ввів число та це число не є відємним
Не використовувати функції або інші матеріали які ми не вивчали
Намагайтесь робити ДЗ самостійно та не дивитися будьякі підказки.*/


let year = prompt("Вкажіть будь ласка рік:");


if (!isNaN(year) && year >= 0) {
  
    let lastyear = year % 10;
    let twoyear = year % 100;
    let result;

   
    if (twoyear = 11 && twoyear <= 14) {
        result = year + " років";
    } else if (lastyear === 1) {
        result = year + " рік";
    } else if (lastyear >= 2 && lastyear <= 4) {
        result = year + " роки";
    } else {
        result = year + " років";
    }


    console.log(result);
} else {
    
    console.log("Вкажіть будь ласка рік коректно");
}

